# `DataFrames` Basic Operations:

In [14]:
import numpy as np 
import pandas as pd

In [15]:
sample_df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [16]:
sample_df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

## 1. `Shape`(Row, Column) of `DataFrame`:

In [17]:
sample_df.shape

(5, 3)

## 2. Displaying the `lables` of columns in DataFrame:

In [18]:
sample_df.columns

Index(['A', 'B', 'C'], dtype='object')

## 3. `info()` about columns:

In [19]:
sample_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

## 4. `Describe` the `Dataframe`:

In [20]:
sample_df.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

## 5. `Broadcasting` a `DataFrame`:
* ### Broadcasting in NumPy allows us to perform arithmetic operations on arrays of different shapes without reshaping them.
* ### It automatically adjusts the smaller array to match the larger array's shape by replicating its values along the necessary dimensions. 
* ### This makes element-wise operations more efficient by reducing memory usage and eliminating the need for loops.

In [26]:
sample_df['B'] * 10

0    100
1    200
2    300
3    400
4    500
Name: B, dtype: int64

In [22]:
sample_df['A'] + 10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

In [27]:
sample_df['C'] - 70

0     30
1    130
2    230
3    330
4    430
Name: C, dtype: int64

## 5. `DataFrame` `apply()` Function:
* ### By apply method in DataFrame we can broad cast a function to every element/cell in a DataFrame

In [31]:
sample_df['D'] = sample_df['B'].apply(lambda x : x**2)
sample_df

   A   B    C     D            E
0  1  10  100   100      1000000
1  2  20  200   400     64000000
2  3  30  300   900    729000000
3  4  40  400  1600   4096000000
4  5  50  500  2500  15625000000

In [30]:
def cube_value(numbers: int):
    return numbers**3

sample_df['E']=sample_df['D'].apply(cube_value)
sample_df

   A   B    C     D            E
0  1  10  100   100      1000000
1  2  20  200   400     64000000
2  3  30  300   900    729000000
3  4  40  400  1600   4096000000
4  5  50  500  2500  15625000000